#include <stdio.h>

int main(int argc, const char *argv[])
{
	

	int a[3][4] = {4, 3, 8, 7, 2};


	printf("*****二维数组的数组名+1就移动了一行数据*****");
	//数组名代表的是数组首元素的地址
	//a[3][4]的首元素是a[0],第二个元素时a[1], 第三个元素是a[2]
	printf("a=%p\n", a);
	printf("a+1=%p\n", a+1);//a+1代表的时a[1]的地址
	printf("&a[0] = %p\n", &a[0]);


	//a[0]代表的时a[0][0]这个元素的地址
	printf("a[0]=%p\n", a[0]);//a[0]是包括a[0][0],a[0][1],a[0][2],a[0][3]的一个一维数组
	printf("&a[0][0] = %p\n", &a[0][0]);
	printf("a[0]+1=%p\n", a[0]+1);//往下移动一个数据，代表的a[0][1]的地址

	return 0;
}
